#nullable disable
/*
 این امر برای مواردی که نیاز به بررسی خالی بودن فیلد ها نیست در نظر گرفته میشود
 */


namespace Domain.Entities;

public struct Product
{
    public long Id;
    public string Name;
    public string Price;
    public bool IsExist;
}

/*
 یک دیتا تایپ است 
جایگزین سبک برای کلاس هاست
می توان بی شی ساختن به ان ها مقدار دهی کرد
نمیتواند پراپ داشته باشد بلکه به جای ان ها متغیر دارد 
مقدار اولیه و متود ندارد 
اگر در ان متود تعریف کنیم باید که از ان شی بسازیم 
از جنس value type است 
میتواند اینترفیس پیاده سازی کند ولی نمیتواند ارث بری بکند 
تا زمانی که به فیلد های ان مقدار داده نشده باشد حتی اگر new 
شده باشد فضایی در حافظه به ان اختصاص داده نمی شود

میتواند سازنده داشته باشد ولی باید تمامی متغیر هایش در سازنده مقدار دهی شوند 
به صورت پیش فرض سازنده دارد 
 */